---
type: DocumentPrintedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# DocumentPrintedEventArgs

`Autodesk.Revit.DB.Events.DocumentPrintedEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetFailedViewElementIds | 2010 | `public IList < ElementId > GetFailedViewElementIds ()` |
| Method | GetPrintedViewElementIds | 2010 | `public IList < ElementId > GetPrintedViewElementIds ()` |